package main

import (
    "fmt"
)

func main () {

    sentence := "Πολύ λίγα πράγματα συμβαίνουν στο σωστό χρόνο, και τα υπόλοιπα δεν συμβαίνουν καθόλου"
    // частотный словарь символов (рун)
    frequency := make(map[rune]int) // ключами будут знаки, а значениями — количество вхождений

    for _, v := range sentence {    // пройдёмся по знакам в предложении
        frequency[v]++              // встреченному знаку увеличиваем частоту
    }

    for k, v := range frequency {
        fmt.Printf("Знак %c встречается %d раз \n", k, v)
    } 
}